roles/emacs/files/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
(setq user-full-name "Egor Lukin"
      user-mail-address "lukin.net@gmail.com")

(setq multi-term-program-switches "--login")

;; (setq doom-theme 'doom-gruvbox-light)
;; (setq doom-theme 'doom-palenight)
;; (setq doom-theme 'doom-moonlight)
(setq doom-theme 'doom-dracula)

(setq doom-font (font-spec :family "monospace" :size 42 :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "sans" :size 42))

(setq display-line-numbers-type t)

(after! org
  (setq org-directory "~/org/"))

(after! org
  (setq org-todo-keywords
        '((sequence "TODO" "IN-PROGRESS" "WAIT" "SKIP" "DELEGATED" "SCHEDULED" "|" "DONE" "CLOSED" "MOVED")))
  (setq org-agenda-files '("roam/gtd/gtd.org" "roam/gtd/backlog.org" "roam/gtd/routines.org" "roam/gtd/birthday.org" "roam/gtd/scheduled.org")))

(setq org-refile-targets
      '(("~/org/roam/gtd/gtd.org" :maxlevel . 2)
        ("~/org/roam/gtd/routines.org" :maxlevel . 2)
        ("~/org/roam/gtd/scheduled.org" :maxlevel . 2)
        ("~/org/roam/gtd/backlog.org" :maxlevel . 2)))

(setq org-download-dir "~/Pictures/Screenshots")

(after! org
  (setq org-log-done t)
  (setq org-log-into-drawer t))

(after! org
  (setq org-archive-location "~/org/roam/gtd/archived/09-2022.org::"))

(require 'org-habit)
(setq org-habit-show-habits-only-for-today t)
(setq org-habit-preceding-days 25)
(setq org-habit-following-days 3)

(setq projectile-project-search-path '("~/Projects/"))

(setq helm-mode-fuzzy-match t)

(setq ivy-re-builders-alist
      '((counsel-ag . regexp-quote)
        (t      . ivy--regex-fuzzy)))

(setq ein:output-area-inlined-images t)

;; Google Translate Integration
(global-set-key "\C-ct" 'google-translate-at-point)
(global-set-key "\C-cr" 'google-translate-at-point-reverse)
(global-set-key "\C-cT" 'google-translate-query-translate)

(setq google-translate-default-source-language '"en")
(setq google-translate-default-target-language '"ru")

(setq google-translate-backend-method 'curl)

(use-package google-translate
  ;; :ensure t
  :custom
  (google-translate-backend-method 'curl)
  :config
   (defun google-translate--search-tkk () "Search TKK." (list 430675 2721866130)))

(setq browse-url-browser-function 'eww-browse-url)
(setq eww-download-directory "~/cached-web-pages")

(after! elfeed
  (setq elfeed-search-filter "@1-month-ago +unread"))
