roles/emacs/files/doom.org
** Org-Roam
#+begin_src elisp :tangle config.el
(defun my/org-roam-node-find-by-directory ()
  (interactive)
  (let* ((directories '("tasks" "literate" "conceptual" "projects" "planning"))
        (directory (completing-read "Enter directory: " directories)))
    (org-roam-node-find t nil
                        (lambda (node)
                          (let ((tags (org-roam-node-tags node)))
                            (member directory tags))))))

(after! org-roam
  (setq org-roam-directory "~/org/roam")
  (setq org-roam-db-location  "~/org/roam/org-roam.db")

  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry
           "* %?"
           :target (file+head "%<%Y-%m-%d>.org"
                              "#+title: %<%A, %d %B %Y>\n"))))

  (setq org-roam-capture-templates
        '(("t" "Task note" plain
           "%?"
           :if-new (file+head "tasks/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :tasks\n")
           :unnarrowed t)
          ("l" "Literate note" plain
           "%?"
           :if-new (file+head "literate/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :literate\n")
           :unnarrowed t)
          ("c" "Conceptual note" plain "%?"
           :if-new (file+head "conceptual/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :conceptual\n")
           :unnarrowed t)
          ("r" "Planning note" plain "%?"
           :if-new (file+head "planning/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :planning\n")
           :unnarrowed t)
          ("p" "Project note" plain
           "%?"
           :if-new (file+head "project/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :projects\n")
           :unnarrowed t)))

  (map! :leader
        :prefix "r"
        :desc "org-roam-node-insert" "i" #'org-roam-node-insert
        :desc "org-roam-node-find" "f" #'org-roam-node-find
        :desc "org-roam-node-find-by-directory" "t" #'my/org-roam-node-find-by-directory
        :desc "org-roam-dailies-goto-date" "s" #'org-roam-dailies-goto-date
        :desc "org-roam-dailies-goto-today" "d" #'org-roam-dailies-goto-today
        :desc "org-roam-buffer" "l" #'org-roam-buffer
        :desc "org-roam-show-graph" "g" #'org-roam-show-graph
        :desc "org-roam-dailies-find-next-note" "n" #'org-roam-dailies-find-next-note
        :desc "org-roam-dailies-find-previous-note" "p" #'org-roam-dailies-find-previous-note
        :desc "org-roam-capture" "c" #'org-roam-capture))
#+end_src
** Org-Capture
#+begin_src elisp :tangle config.el
(defun my/daily-note-filename ()
  (let ((date (format-time-string "%Y-%m-%d" (current-time))))
    (concat
     "~/org/roam/daily/"
     date
     ".org")))


;; %Y-%m-%d.org
(after! org
  (setq org-capture-templates
        '(("t" "Todo" entry
           (file+headline "roam/gtd/gtd.org" "Inbox")
           (file "templates/todo.org"))
          ("e" "English word" entry
           (file+headline "anki/english_words.org" "Backlog")
           (file "templates/english_words.org"))
          ("m" "Write message" entry
           (file+headline (lambda () (my/daily-note-filename)) "messages")
           (file "templates/message.org"))
          ("b" "Add entry to daily buffer" entry
           (file+headline (lambda () (my/daily-note-filename)) "buffer")
           (file "templates/buffer.org")))))
#+end_src
** Deft
#+begin_src elisp :tangle config.el
(setq deft-directory "~/org")
(setq deft-extensions '("txt" "tex" "org"))
(setq deft-recursive t)
#+end_src

#+begin_src elisp
(map! :leader
      (:prefix-map ("d" . "deft")
       :desc "deft-find-file" "f" #'deft-find-file))
#+end_src
** Org-Babel
#+begin_src elisp :tangle config.el
(map! :leader
      (:prefix-map ("b" . "babel")
       :desc "org-babel-execute-src-block" "b" #'org-babel-execute-buffer))

(setq org-babel-pry-command "pry")
#+end_src

#+begin_src elisp
;; (defun org-babel-execute:pry (body params)
;;   "Execute a block of ruby code with pry."
;;   (message "executing ruby source code block in pry")
;;   (string-remove-suffix "\\\"" (string-remove-prefix "\"" (string-remove-prefix "[0G" (org-babel-eval "~/.gems/bin/pry" body)))))

(defun org-babel-execute:pry (body params)
  "Execute a block of ruby code with pry."
  (message "executing ruby source code block in pry")
  (substring (org-babel-eval "~/.gems/bin/pry" body) 5 -2))
#+end_src

#+RESULTS:
: org-babel-execute:pry

#+begin_src elisp
(defvar c (org-babel-eval "~/.gems/bin/pry" "hello_world"))

(defvar b
  (string-remove-prefix "[0G"
    (org-babel-eval "~/.gems/bin/pry" "hello_world")))

(string-remove-prefix "\"" (string-remove-suffix "\"" b))
(string-remove-suffix "\\\"" b)
b
c
(defvar d (substring c 5 -2))
d
(print d)

(replace-regexp-in-string "\\\\" "\\" d)
;; (replace-regexp-in-string "\\\\\\(.\\|\n\\)" "\\1" d)
#+end_src

#+begin_src pry :results value raw
hello_world
#+end_src

#+RESULTS:
hello world

#+begin_src ruby

p "hello\nworld"
#+end_src

#+RESULTS:
: hello
: world

org-block formatting

#+begin_src pry :results value raw
question = <<HEREDOC
I want you to act as a Life Coach. Please summarize this non-fiction book, Tools of Titans by Tim Ferris. Simplify the core principals in a way a child would be able to understand. Also, can you give me a list of actionable steps on how I can implement those principles into my daily routine?
HEREDOC

chat_gpt(question)
#+end_src

#+RESULTS:
I want you to act as a Life Coach. Please summarize this non-fiction book, Tools of Titans by Tim Ferris. Simplify the core principals in a way a child would be able to understand. Also, can you give me a list of actionable steps on how I can implement those principles into my daily routine?\n"
"Tools of Titans by Tim Ferriss is a book that shares the success secrets of over 200 world-class performers. The core principles of this book can be simplified as follows: strive to be the best version of yourself, stay focused on your goals, work hard, be persistent, and learn from failure. To implement these principles in your daily life, here are some actionable steps you can take:

Set specific and achievable goals for yourself each day.
Make a plan to achieve those goals and stick to it.
Identify the obstacles that may prevent you from reaching your goals, and come up with strategies to overcome them.
Make time for regular self-reflection and feedback.
Push yourself out of your comfort zone and challenge yourself to learn new skills.
Surround yourself with people who can motivate and inspire you.
Celebrate your successes, no matter how small, and learn from your mistakes.

#+begin_src pry :results value raw
question = <<HEREDOC
list 10 ways to become a better programmer?
HEREDOC

chat_gpt(question)
#+end_src

#+RESULTS:
list 10 ways to become a better programmer?\n"
"Here are 10 ways to become a better programmer: \n\nMake use of resources such as tutorials, books, and online courses.\nPractice, practice, practice.\nLearn a new language.\nWork on open-source projects.\nGet involved in the programming community.\nWrite code for fun.\nDevelop problem-solving skills.\nRefactor existing code.\nLearn about software design patterns.\nKeep up with the latest trends and technologies.\n\n
=> "Here are 10 ways to become a better programmer:\n\nLearn the fundamentals of programming.\nPractice regularly and create projects.\nUtilize resources like books and online tutorials.\nLearn coding best practices.\nGet feedback from experienced developers.\nStay up-to-date on new programming tools and technologies.\nJoin a coding community.\nTake online coding courses.\nAttend hackathons and coding events.\nPair program with experienced developers.\n\n"

** Org-Clock
#+begin_src elisp :tangle config.el
(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)
(setq org-clock-persist t)
#+end_src
** Openwith
#+begin_src elisp :tangle config.el
(require 'openwith)
(openwith-mode t)
(setq openwith-associations
            (list
             (list (openwith-make-extension-regexp
                    '("mpg" "mpeg" "mp3" "mp4"
                      "avi" "wmv" "wav" "mov" "flv"
                      "ogm" "ogg" "mkv"))
                   "vlc"
                   '(file))
             (list (openwith-make-extension-regexp
                    '("xbm" "pbm" "pgm" "ppm" "pnm"
                      "png" "gif" "bmp" "tif" "jpeg" "jpg"))
                   "eog"
                   '(file))
             '("\\.pdf" "evince" (file))
             '("\\.djvu" "evince" (file))
             ))
#+end_src
** Polybar Integration
Show current active clock in polybar.
#+begin_src elisp :tangle config.el
(defvar polybar--default-header "no active clocks!")

(defun polybar--format-line (task time)
  (concat task " ("(number-to-string time) " min)"))

(defun polybar-current-clock-line ()
  (interactive)
  (message
   (if (org-clocking-p)
       (let ((header org-clock-heading)
             (time
              (floor
               (org-time-convert-to-integer (time-since org-clock-start-time))
               60)))
         (polybar--format-line header time))
     polybar--default-header)))

(map! :leader :prefix "b" :desc "polybar-current-clock-line" "c" #'polybar-current-clock-line)
#+end_src
** Hledger
#+begin_src elisp :tangle config.el
(setq hledger-jfile "~/org/finances/ledger.journal")
#+end_src
** Snippets
#+begin_src elisp :tangle config.el
;; Develop in ~/emacs.d/mysnippets, but also
;; try out snippets in ~/Downloads/interesting-snippets
(setq yas-snippet-dirs '("~/org/snippets"
                         "~/emacs.d/mysnippets"))
#+end_src
** Reverso
Setup my custom script for working with Reverso search:
#+begin_src elisp :tangle packages.el
(package! reverso :recipe (:repo "https://github.com/LukinEgor/reverso-emacs"))
#+end_src

#+begin_src elisp :tangle config.el
(use-package! reverso)
(after! reverso
  (setq reverso-default-source-lang "english")
  (setq reverso-default-target-lang "russian")

  (map! :leader
        :prefix "k"
        :desc "reverso-direct-search" "d" #'reverso-direct-search
        :desc "reverso-reverse-search" "r" #'reverso-reverse-search))
#+end_src
** Yasnippets
